Revit 2026 API

# LoadCombinationGetComponents Method

---

Returns collection of the load combination components.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<LoadComponent> GetComponents()
```
```vb
Public Function GetComponents As IList(Of LoadComponent)
```
```cpp
public:
IList<LoadComponent^>^ GetComponents()
```
```fsharp
member GetComponents : unit -> IList<LoadComponent>
```

#### Return Value

IListLoadComponent A collection of the load combination components.

#### Reference

LoadCombination Class

Autodesk.Revit.DB.Structure Namespace